# SizingFailedZeroFlow Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GenericMEPFailures..::..SizingFailedZeroFlow Property
BuiltInFailures..::..GenericMEPFailures Class See Also
---
Sizing failed. Flow for section is 0.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId SizingFailedZeroFlow { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SizingFailedZeroFlow As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ SizingFailedZeroFlow {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..GenericMEPFailures Class
Autodesk.Revit.DB Namespace